# VerticalAlignment Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNode..::..VerticalAlignment Property
TextNode Class See Also
---
Indicates default vertical alignment of the text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public VerticalTextAlignment VerticalAlignment { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VerticalAlignment As VerticalTextAlignment
	Get
```

Visual C++
---
```text
public:
property VerticalTextAlignment VerticalAlignment {
	VerticalTextAlignment get ();
}
```

# See Also
TextNode Class
Autodesk.Revit.DB Namespace